api/app/controllers/api/pokemon_controller.rb

SELECT  "pokemons".* FROM "pokemons"  WHERE "pokemons"."id" = 1 LIMIT 1
---
  def by_id
    p = Pokemon.find_by_id(params[:id].to_i)

SELECT "pokemons".* FROM "pokemons"  WHERE (species LIKE '%bul%')
---
  def autocomplete
    pokemon = Pokemon.where("species LIKE ?", "%#{params[:species]}%")

SELECT  "formats".* FROM "formats"  WHERE "formats"."name" = 'RU' LIMIT 1
---
  def random_format
      pokes = Format.find_by_name(params[:format]).pokemons