api/app/controllers/api/team_controller.rb

  def show
    team = ApplicationController::Team.find(params[:id].to_i)
---
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 18]]

  def create
    team = ApplicationController::Team.new
    team.name = params[:name]
    team.user = current_user
    team.format = ApplicationController::Format.find_by_name(params[:tier])
    team.populate_on_creation = params[:populate]
    team.private = params[:private]
    team.save()
---
SELECT  "formats".* FROM "formats"  WHERE "formats"."name" = 'RU' LIMIT 1
INSERT INTO "team_formats" ("created_at", "format_id", "team_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-15 23:03:06.618581"], ["format_id", 6], ["team_id", 18], ["updated_at", "2015-01-15 23:03:06.618581"]]
INSERT INTO "teams" ("created_at", "name", "options", "populate_on_creation", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-15 23:07:56.679905"], ["name", "Untitled"], ["options", nil], ["populate_on_creation", "t"], ["updated_at", "2015-01-15 23:07:56.679905"]]

  def update
    team = ApplicationController::Team.find(params[:id].to_i)
    if current_user != team.user
      return render :json => {success: false}
    end
    team.pokemons = []
    if params[:pokemons].is_a? Array
      params[:pokemons].first(6).each do |p|
        begin
          team.pokemons << ApplicationController::Pokemon.find(p[:id].to_i)
        rescue
        end
      end
    end
   # team.pokemons = pokes
    team.name = params[:name]
    team.format = ApplicationController::Format.find_by_name(params[:tier])
    team.save()
---
SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = ? LIMIT 1  [["id", 18]]
SELECT "team_pokemons".* FROM "team_pokemons"  WHERE "team_pokemons"."team_id" = ?  [["team_id", 18]]
INSERT INTO "team_pokemons" ("created_at", "pokemon_id", "team_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-15 23:06:51.967880"], ["pokemon_id", 764], ["team_id", 18], ["updated_at", "2015-01-15 23:06:51.967880"]]
SELECT "pokemons".* FROM "pokemons" INNER JOIN "team_pokemons" ON "pokemons"."id" = "team_pokemons"."pokemon_id" WHERE "team_pokemons"."team_id" = ?  [["team_id", 18]]
SELECT  "formats".* FROM "formats"  WHERE "formats"."name" IS NULL LIMIT 1
UPDATE "teams" SET "options" = ?, "private" = ?, "updated_at" = ? WHERE "teams"."id" = 18  [["options", nil], ["private", "f"], ["updated_at", "2015-01-15 23:06:52.068207"]]